# PySpark 

INSERT JUSTIFICATION AND EXPLENTATION OF WHY WE NEED PYSPARK

INSET EXPLENATION OF CORE CONCEPTS SUCH AS CLUSTER MANAGER AND LAZY EVALUATION

In [3]:
import pyspark

In [5]:
import pandas as pd 

titanic_path = "./titanic.csv"
titanic_df = pd.read_csv(titanic_path)

titanic_df.head()

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500

In [13]:
# The spark session is the entery point to programming with spark with the Dataframe and Dataset API
from pyspark.sql import SparkSession

In [14]:
# Creating a spark session 
spark = SparkSession.builder.appName("Sample").getOrCreate()

In [15]:
spark

In [16]:
df_pyspark = spark.read.csv(titanic_path)

In [18]:
df_pyspark.show(5)

+--------+------+--------------------+------+---+--------------------+--------------------+-------+
|     _c0|   _c1|                 _c2|   _c3|_c4|                 _c5|                 _c6|    _c7|
+--------+------+--------------------+------+---+--------------------+--------------------+-------+
|Survived|Pclass|                Name|   Sex|Age|Siblings/Spouses ...|Parents/Children ...|   Fare|
|       0|     3|Mr. Owen Harris B...|  male| 22|                   1|                   0|   7.25|
|       1|     1|Mrs. John Bradley...|female| 38|                   1|                   0|71.2833|
|       1|     3|Miss. Laina Heikk...|female| 26|                   0|                   0|  7.925|
|       1|     1|Mrs. Jacques Heat...|female| 35|                   1|                   0|   53.1|
+--------+------+--------------------+------+---+--------------------+--------------------+-------+
only showing top 5 rows

In [28]:
df_pyspark = spark.read.option("header", "true").csv(titanic_path)
df_pyspark.show(10)

+--------+------+--------------------+------+---+-----------------------+-----------------------+-------+
|Survived|Pclass|                Name|   Sex|Age|Siblings/Spouses Aboard|Parents/Children Aboard|   Fare|
+--------+------+--------------------+------+---+-----------------------+-----------------------+-------+
|       0|     3|Mr. Owen Harris B...|  male| 22|                      1|                      0|   7.25|
|       1|     1|Mrs. John Bradley...|female| 38|                      1|                      0|71.2833|
|       1|     3|Miss. Laina Heikk...|female| 26|                      0|                      0|  7.925|
|       1|     1|Mrs. Jacques Heat...|female| 35|                      1|                      0|   53.1|
|       0|     3|Mr. William Henry...|  male| 35|                      0|                      0|   8.05|
|       0|     3|     Mr. James Moran|  male| 27|                      0|                      0| 8.4583|
|       0|     1|Mr. Timothy J McC...|  male| 54|                      0|                      0|51.8625|
|       0|     3|Master. Gosta Leo...|  male|  2|                      3|                      1| 21.075|
|       1|     3|Mrs. Oscar W (Eli...|female| 27|                      0|                      2|11.1333|
|       1|     2|Mrs. Nicholas (Ad...|female| 14|                      1|                      0|30.0708|
+--------+------+--------------------+------+---+-----------------------+-----------------------+-------+
only showing top 10 rows

In [30]:
df_pyspark.printSchema()

root
 |-- Survived: string (nullable = true)
 |-- Pclass: string (nullable = true)
 |-- Name: string (nullable = true)
 |-- Sex: string (nullable = true)
 |-- Age: string (nullable = true)
 |-- Siblings/Spouses Aboard: string (nullable = true)
 |-- Parents/Children Aboard: string (nullable = true)
 |-- Fare: string (nullable = true)

## Pyspark dataframe notes

- What are PySpark Dataframes
- Reading the Dataset
- Checking the datatypes and coloumn (schema)
- Other similar operations
- Basically we are going to see how to do some data pre-processing with pyspark